espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_semailbox.h
/** @} End of group EFR32MR21_SEMAILBOX_HOST_BitFields */
/** @} End of group EFR32MR21_SEMAILBOX_HOST */
/**************************************************************************//**
 * @defgroup EFR32MR21_SEMAILBOX_SE SEMAILBOX_SE
 * @{
 * @brief EFR32MR21 SEMAILBOX_SE Register Declaration.
 *****************************************************************************/

/** SEMAILBOX_SE Register Declaration. */
typedef struct {
  __IOM uint32_t NEW_REG;                            /**< New Register                                       */
} SEMAILBOX_SE_TypeDef;
/** @} End of group EFR32MR21_SEMAILBOX_SE */

/**************************************************************************//**
 * @addtogroup EFR32MR21_SEMAILBOX_SE
 * @{
 * @defgroup EFR32MR21_SEMAILBOX_SE_BitFields SEMAILBOX_SE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for SEMAILBOX NEW_REG */
#define _SEMAILBOX_NEW_REG_RESETVALUE        0x00000000UL                               /**< Default value for SEMAILBOX_NEW_REG         */
#define _SEMAILBOX_NEW_REG_MASK              0x00000001UL                               /**< Mask for SEMAILBOX_NEW_REG                  */
#define SEMAILBOX_NEW_REG_NEWBIT             (0x1UL << 0)                               /**< New BitField                                */
#define _SEMAILBOX_NEW_REG_NEWBIT_SHIFT      0                                          /**< Shift value for SEMAILBOX_NEWBIT            */
#define _SEMAILBOX_NEW_REG_NEWBIT_MASK       0x1UL                                      /**< Bit mask for SEMAILBOX_NEWBIT               */
#define _SEMAILBOX_NEW_REG_NEWBIT_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for SEMAILBOX_NEW_REG          */
#define SEMAILBOX_NEW_REG_NEWBIT_DEFAULT     (_SEMAILBOX_NEW_REG_NEWBIT_DEFAULT << 0)   /**< Shifted mode DEFAULT for SEMAILBOX_NEW_REG  */

/** @} End of group EFR32MR21_SEMAILBOX_SE_BitFields */
/** @} End of group EFR32MR21_SEMAILBOX_SE */
/** @} End of group Parts */

#endif /* EFR32MR21_SEMAILBOX_H */
